Revit 2026 API

# WorksharedOperationProgressChangedEventArgs Properties

---

The WorksharedOperationProgressChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Location | Full path of the central model which is to be operated. |
|  | Status | Gets API event status, reflect current operation execution status. |

#### Reference

WorksharedOperationProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace